pages/applicability/transport_of_data.md
```mermaid
sequenceDiagram
    participant A as Site
    participant B as Supervision system
    A->>B: RSMP/SXL version
    Note over B: Verify RSMP version, SXL version and site id
    B->>A: RSMP/SXL version
    Note over A: Verify RSMP version, SXL version and site id
    Note over A,B: RSMP version is selected based upon what<br/>site/supervisor support
    A->>B: Watchdog
    B->>A: Watchdog
    A->>B: ComponentList
    Note over A,B: Asynchronous message exchange can begin
    A->>B: Aggregated status
    A->>B: All alarms
    A->>B: Buffered messages
```
