pages/applicability/transport_of_data.md
```mermaid
sequenceDiagram
    participant A as Site (follower)
    participant B as Site (leader)
    A->>B: RSMP/SXL version
    Note over B: Verify RSMP version, SXL version and site id
    B->>A: RSMP/SXL version
    Note over A: Verify RSMP version, SXL version and site id
    Note over A,B: RSMP version is selected based upon what sites support
    A->>B: Watchdog
    B->>A: Watchdog
    A->>B: ComponentList
    Note over A,B: Asynchronous message exchange can begin
    A->>B: Aggregated status
```
